In [1]:
# importing packages
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings

In [2]:
# configuring the notebook
pd.set_option("display.max_columns", None)
sns.set_theme(style = "whitegrid")
warnings.filterwarnings("ignore")

In [3]:
df = pd.read_csv("onion_prices_bangalore_2004_2024.csv")
df.head()

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Unnamed: 10
0,Karnataka,Bangalore,Bangalore,Bangalore-Samall,Vegetables,133.0,400,440,420,06 Sep 2006,NaN
1,Karnataka,Bangalore,Bangalore,Bangalore-Samall,Vegetables,230.0,200,400,300,18 Aug 2016,NaN
2,Karnataka,Bangalore,Bangalore,Bangalore-Samall,Vegetables,301.0,300,340,320,04 Oct 2006,NaN
3,Karnataka,Bangalore,Bangalore,Bangalore-Samall,Vegetables,342.0,800,1400,1100,29 Jun 2015,NaN
4,Karnataka,Bangalore,Bangalore,Bangalore-Samall,Vegetables,344.0,1200,2400,1700,10 Aug 2015,NaN

In [4]:
df.shape

(12668, 11)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12668 entries, 0 to 12667
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   State Name                 12668 non-null  object
 1   District Name              12668 non-null  object
 2   Market Name                12668 non-null  object
 3   Variety                    12668 non-null  object
 4   Group                      12668 non-null  object
 5   Arrivals (Tonnes)          12668 non-null  float64
 6   Min Price (Rs./Quintal)    12668 non-null  int64
 7   Max Price (Rs./Quintal)    12668 non-null  int64
 8   Modal Price (Rs./Quintal)  12668 non-null  object
 9   Reported Date              12667 non-null  object
 10  Unnamed: 10                0 non-null      float64
dtypes: float64(2), int64(2), object(7)
memory usage: 1.1+ MB

In [6]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Arrivals (Tonnes),12668.0,492.541364,287.567975,0.0,244.0,488.0,744.0,1200.0
Min Price (Rs./Quintal),12668.0,1056.107515,884.339898,50.0,500.0,800.0,1400.0,13000.0
Max Price (Rs./Quintal),12668.0,1495.384670,1137.914226,200.0,800.0,1200.0,1800.0,22500.0
Unnamed: 10,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN